[
  {
    "name": "Wack0/entii-for-workcubes",
    "stars": 708,
    "description": "PowerPC Windows NT ported to Nintendo GameCube/Wii/Wii U",
    "languages_breakdown": {
      "C": 17201011,
      "C++": 980261,
      "Assembly": 61565,
      "Makefile": 59405,
      "BitBake": 26703,
      "Linker Script": 4187,
      "Prolog": 2707,
      "Pawn": 1460
    },
    "files": {
      "README.md": "\n[![Visit our Discord server](https://discordapp.com/api/guilds/1301249042256363673/widget.png)](https://discord.gg/S8jWsc4SAq)\n\n# Windows NT for GameCube/Wii\n\nThe following systems are supported:\n* Nintendo GameCube\n* Nintendo Wii\n  * Wii Mini requires SD card hardmod (for now)\n* Nintendo Wii U (**vWii only for now**)\n\nThe following systems are theoretically supported, although not tested due to the rarity of such hardware:\n* Broadway Evaluation Board\n* Cortado boards\n\nThe following systems will NEVER be supported:\n* early Dolphin Development Hardware with only 4MB of usable RAM\n\n## Drivers present\n\n* Flipper interrupt controller (in HAL)\n* Flipper Video Interface console framebuffer (YUV XFB) for ARC firmware and HAL\n* Flipper GPU RGB framebuffer under NT (writing to EFB under text setup, writing to texture under GDI; copying out to XFB on vblank interrupt)\n* Flipper Serial Interface (gamecube controller ports), supporting the following devices:\n  * GameCube ASCII keyboard controller, plus unreleased English/European variants (discovered through reversing Phantasy Star Online); the latter are completely untested, the former has not been tested on real hardware\n  * GameCube controller, with the following mappings:\n    * Under ARC firmware: left analog stick and d-pad maps to up/down, A button maps to enter, B button maps to escape, X button maps to letter 'S'\n    * Under NT text setup: left analog stick and d-pad maps to up/down, c-stick maps to page up/page down, A button maps to enter, B button maps to escape, X button maps to F8, Y button maps to letter 'C', Z button maps to letter 'L'\n    * Under NT GDI: left analog stick moves mouse, A button maps to left mouse button, B button maps to right mouse button, L+R together maps to ctrl+alt+del, c-stick allows for choosing a keyboard scancode (1-9, 0, a-z), X button confirms the selected scancode. Numbers are first in the list so numeric-only text boxes (like entering CD key) still works.\n  * N64 Randnet keyboard, completely untested so may have issues\n  * N64 mouse (under NT only), completely untested so may have issues\n  * N64 controller (completely untested so may have issues), with the following mappings:\n    * Under ARC firmware: left analog stick and d-pad maps to up/down, A button maps to enter, B button maps to escape, Z button maps to letter 'S'\n    * Under NT text setup: left analog stick and d-pad maps to up/down, c-stick maps to page up/page down, A button maps to enter, B button maps to escape, Z button maps to F8, L trigger maps to letter 'C', R trigger maps to letter 'L'\n    * Under NT GDI: left analog stick moves mouse, A button maps to left mouse button, B button maps to right mouse button, L+R together maps to ctrl+alt+del, c-down and c-up allows for choosing a keyboard scancode (1-9, 0, a-z), start button confirms the selected scancode. Numbers are first in the list so numeric-only text boxes (like entering CD key) still works.\n* Flipper External Interface (SPI bus), supporting\n... (truncated)"
    }
  },
  {
    "name": "Wack0/maciNTosh",
    "stars": 678,
    "description": "PowerPC Windows NT ported to Power Macintosh systems",
    "languages_breakdown": {
      "C": 2298101,
      "Assembly": 41956,
      "Makefile": 14417,
      "Rez": 781
    },
    "files": {
      "README.md": "\n# Windows NT for Power Macintosh\n\nThis repository currently contains the source code for the ARC firmware and its loader, targeting Power Macintosh systems using the *Gossamer* architecture (that is, MPC106 \"Grackle\" memory controller and PCI host, and \"Heathrow\" or \"Paddington\" super-I/O chip on the PCI bus). That is, the following systems:\n\n* Power Macintosh G3 (beige)\n* Macintosh PowerBook G3 Series *\"Wallstreet\"*, *\"PDQ\"*\n* iMac G3 (tray-loading)\n* Power Macintosh G3 (Blue & White) *\"Yosemite\"*\n* Macintosh PowerBook G3 Bronze Keyboard *\"Lombard\"* \n* Power Macintosh G4 PCI *\"Yikes!\"*\n\nThe repository additionally contains the source code for the ARC firmware and its loader, targeting PowerPC Macintosh systems using the *Mac99* architecture (the first iteration of which being the \"Uni-North\" memory controller and PCI host, and \"KeyLargo\" super-I/O chip on the PCI bus; later derivatives like \"Intrepid\" are also supported). That is, the following systems:\n\n* PowerBook G3 Firewire *\"Pismo\"*\n* iBook G3\n* iBook G4\n** The mid-2005 iBook G4 (`PowerBook6,7`) uses a USB mouse internally and therefore mouse will not work yet.\n* PowerBook G4\n** The early 2005 and later PowerBook G4s (`PowerBook6,8` and `PowerBook5,6` and later) use a USB keyboard and mouse and are therefore currently not practically supported.\n\nThe following systems are theoretically supported, but currently not practically supported due to the lack of USB drivers:\n\n* iMac G3 (slot-loading)\n* iMac G4\n* Power Macintosh G4 (AGP *\"Sawtooth\"* and later)\n\nThere may be issues on your hardware.\n\nNT HAL and drivers have no source present for now.\n\n## Drivers present in ARC firmware\n\n* Cuda and PMU\n\t* ADB keyboard\n* Flat 32bpp video framebuffer, set up by the loader. Both ATI and nVidia hardware is supported, although some nVidia GPUs do not currently work.\n* Mac I/O internal IDE controllers, forked from OpenBIOS (**there are no drivers for PCI IDE controllers!**)\n** The ATA-6 controllers used on some later Mac99 systems (Intrepid, U2) are supported. Please note LBA48 is not yet supported.\n* On pre-Mac99 systems, MESH SCSI controller.\n* USB OHCI forked from OpenBIOS (**on pre-Mac99 systems, broken, nonworking, and initialisation code commented out**)\n\n## Drivers currently done for NT\n\n* HAL for *Gossamer* chipset, including: NT boot time framebuffer, super I/O interrupt controller, Grackle PCI bus support, Cuda and PMU (including low level ADB), serial port for kernel debugging only\n* HAL for *Mac99* chipset, including: NT boot time framebuffer, MPIC interrupt controller, support for all 3 PCI busses on Uni-North (of which one is AGP, but only the PCI subset is supported), PMU (including low level ADB), serial port for kernel debugging only\n* Mac I/O internal IDE controllers and ATA-6 controllers, forked from `atapi.sys` from NT4 DDK\n* General HID/storage driver, intended to also contain a USB stack in future but currently only implements ADB keyboard/mouse and ramdisk as floppy drive for installi\n... (truncated)"
    }
  },
  {
    "name": "Wack0/bitlocker-attacks",
    "stars": 399,
    "description": "A list of public attacks on BitLocker",
    "languages_breakdown": {},
    "files": {}
  }
]