[
  {
    "name": "nstrayer/datadrivencv",
    "stars": 614,
    "description": "R package for building customizable CVs from spreadsheets",
    "languages_breakdown": {
      "R": 33544,
      "CSS": 4861,
      "JavaScript": 2521
    },
    "files": {
      "README.md": "\n# datadrivencv <img src=\"man/figures/logo.svg\" width=\"185px\" align=\"right\" style=\"border:1px solid black;\">\n\n<!-- badges: start -->\n<!-- badges: end -->\n\nThe goal of datadrivencv is to ease the burden of maintaining a CV by\nseparating the content from the output by treating entries as data.\n\n## Installation\n\nThe development version from [GitHub](https://github.com/) with:\n\n``` r\n# install.packages(\"devtools\")\ndevtools::install_github(\"nstrayer/datadrivencv\")\n```\n\n# Motivation\n\n## Updating a CV is not fun\n\nAnytime I would go to add something to my CV I ended up wanting to\nchange the format a tiny bit. This usually meant the entire word\ndocument completely falling apart and needing to have each entry copied\nand pasted into a new version.\n\nUltimately this process felt formulaic and repetitive, prime indicators\nthey could be done better with code. Using a spreadsheet to store each\nentry in the CV and R to write markdown seemed like the way to go.\nPagedown made this even easier. Meaning that the same CV could be\nrendered with interactive HTML and PDF without changing the underlying\nrendering engine like was done with kniting to pdf vs knitting to html.\n\n<div style=\"text-align: center; padding: 2rem 0;\">\n\n<img src=\"man/figures/csv_to_cv.png\" width=100% />\n\n</div>\n\n## No lock-in\n\nInspired heavily the the `usethis` package, `datadrivencv` strives to\nmake itself unnecessary. The main function is `use_data_driven_cv`,\nwhich sets up the files you need to build your CV. These files are\nself-contained meaning if you uninstall `datadrivencv` your CV will\nstill knit fine. All the R code logic is contained in a sourced script\nso if you want to change it you can do so.\n\nThe package aims to bootstrap you to a working data-driven CV pipeline.\nServing as a jumping off point for you to build your own custom CV, you\nmay at first want to leave it as is and then slowly tweak things to keep\nit fresh. You have all the code, so you can!\n\n# Using it\n\nThe first step to using the package is the `use_data_driven_cv()`\nfunction. This function takes a few input parameters and when when run,\nsets up a series of files in your current working directory. E.g.\n\n``` r\n# run ?datadrivencv::use_datadriven_cv to see more details\ndatadrivencv::use_datadriven_cv(\n  full_name = \"Nick Strayer\",\n  data_location = \"https://docs.google.com/spreadsheets/d/14MQICF2F8-vf8CKPF1m4lyGKO6_thG-4aSwat1e2TWc\",\n  pdf_location = \"https://github.com/nstrayer/cv/raw/master/strayer_cv.pdf\",\n  pdf_location_resume = \"https:///github.com/nstrayer/cv/raw/master/strayer_resume.pdf\"\n  html_location = \"nickstrayer.me/cv/\",\n  html_location_resume = \"nickstrayer.me/cv/resume/\",\n  source_location = \"https://github.com/nstrayer/cv\"\n)\n```\n\nThe available arguments are:\n\n| Argument | Description |\n|----|----|\n| `full_name` | Your full name, used in title of document and header |\n| `data_location` | Path of the spreadsheets holding all your data. This can be either a URL to a google sheet with multiple sheets containing th\n... (truncated)"
    }
  },
  {
    "name": "nstrayer/cv",
    "stars": 535,
    "description": "My CV built using RMarkdown and the pagedown package. ",
    "languages_breakdown": {
      "HTML": 20216045,
      "R": 10029,
      "CSS": 4942
    },
    "files": {
      "README.md": "## My pagedown rendered CV\n\n__Switch to googlesheets__\n\nAs I get older and more crotchety I find it more and more difficult to manually update a CSV. In response to this, I have moved the data-storing mechanism from a plain CSV to google sheets using the wonderful [`googlesheets4` package.](https://googlesheets4.tidyverse.org/index.html) This allows for a much more easy updating system and also makes it easy to store all the other info that didn't feel write to put into a CSV before (like the intro and aside text) right with everything as separate pages/sheets within the main sheet. \n\n\n## Structure\n\nThis repo contains the source-code and results of my CV built with the [pagedown package](https://pagedown.rbind.io) and a modified version of the 'resume' template. \n\nThe main files are:\n\n- `cv.Rmd`: Source template for the cv, contains a YAML variable `pdf_mode` in the header that changes styles for pdf vs html. \n- `render_cv.R`: R script for rendering both pdf and html version of CV at the same time.\n  - `index.html`: The final output of the template when the header variable `PDF_EXPORT` is set to `FALSE`. View it at [nickstrayer.me/cv](http://nickstrayer.me/cv).\n  - `strayer_cv.pdf`: The final exported pdf as rendered by Chrome on my mac laptop. Links are put in footer and notes about online version are added. \n- `styles/*, dd_cv.css`: Custom CSS files used to tweak the default 'resume' format from pagedown. \n- `resume.Rmd`: Source template for single page resume. (Currently neglected compared to CV.)\n  - `resume.html`/`strayer_resume.pdf`: Result for single page resume.\n\n## Want to use this to build your own CV/resume? \n\nI built a package that makes setting up a CV this way rather easy: [`datadrivencv`](http://nickstrayer.me/datadrivencv/).\n\nThe easiest way to get going is running these lines in the directory you want to have your CV in: \n\n```r\ndevtools::install_github(\"nstrayer/datadrivencv\")\n\ndatadrivencv::use_datadriven_cv(full_name = \"My Name\")\n```\n\nThis should populate your directory with the appropriate files to get started building your CV. Just fill in the internals with your own info. For a more detailed set of examples, see the [packages website](http://nickstrayer.me/datadrivencv/) and [docs](http://nickstrayer.me/datadrivencv/reference/use_datadriven_cv.html). \n\n\n## Looking for the old version with just a single CSV?\n\nThe [blog post I originally wrote about this process](https://livefreeordichotomize.com/2019/09/04/building_a_data_driven_cv_with_r/) used an older version of this document. I think that the new googlesheets method is easier to maintain and extend, however the old version is alive and well [here.](https://github.com/nstrayer/cv/releases/tag/1.0)\n\n\n"
    }
  },
  {
    "name": "nstrayer/shinysense",
    "stars": 205,
    "description": "A bunch of shiny modules that let shiny sense the world around it. ",
    "languages_breakdown": {
      "JavaScript": 108069,
      "R": 38184,
      "CSS": 3182
    },
    "files": {
      "README.md": "<p align = 'right'>\n  <a href = \"http://jhudatascience.org/\"> \n    <img src = \"https://raw.githubusercontent.com/jhudsl/drawyourprior/master/WWW/jhu_logo.png\" height=40 />\n  </a>\n</p>\n\n<p align = 'center'>\n  <img src = \"https://github.com/nstrayer/shinysense/raw/master/inst/images/shinysense_wide.png?raw=true\" height=120/>\n</p>\n\n# `shinysense`\n\nA series of [shiny modules](https://www.RStudio.com/resources/webinars/understanding-shiny-modules/) to help shiny sense the world around it.\n\nIt's called `shinysense` because `shinyinputs` seemed kinda lame.\n\n## Senses present:\n\nCurrently the package supports the following 'senses'.\n\n### Touch\n- `drawr` & `shinydrawr`: Draws a line chart that obscures the end of the results, the user then draws what they think the rest of the chart is and then the rest of the chart is revealed. \n  - Blatantly stolen from the New York Times article [You Draw It: What Got Better or\nWorse During Obama’s Presidency](https://www.nytimes.com/interactive/2017/01/15/us/politics/you-draw-obama-legacy.html).\n- `shinyswipr`: Embeds a card that can be swiped in different directions, the swipe direction is returned to shiny. \n\n\n### Vision\n- `shinyviewr`: Record images from a webcam or any other camera connected to browser viewing app.\n\n### Hearing\n- `shinylistenr`: Records audio on a button press and returns the fast-fourier transformed signal to the server.\n\n### Motion\n- `shinymovr`: Capture and return accelerometer data from your phone or tablet.\n  - Used in [this cast spells shiny app](https://jhubiostatistics.shinyapps.io/cast_spells/) to classify spell cast motions using deep learning. \n\n\n## Testing it out\n\nEvery sense included in the package has a demo app. To run the demo app you can run the included function `run_demo()` and pass it the name of the function you want to see. \n\nE.g. \n```r\nshinysense::run_demo('shinyviewr')\n```\n\nThis will run a basic demo application that includes the code behind the app. Giving you a jumping off point for including the function in your app!\n\nAvailable demos include\n\n- `'shinydrawr'`\n- `'shinyviewr'`\n- `'shinyswipr' `\n- `'shinymovr'`\n- `'shinylistenr'`\n- `'draw_your_dist'`: A demo app using `shinydrawr` to fit a beta distribution to a drawn line.\n\n\n## How do I use it?\n\n`shinysense` is not currently on CRAN. To install it use the `devtools` github function.\n\n```r\ndevtools::install_github(\"nstrayer/shinysense\")\n```\n\nOnce the app is installed just included it in your shiny app the way you usually would:\n\n```r\n#my super cool shiny app\nlibrary(shiny)\nlibrary(shinysense)\n```\n\n\n## Naming Scheme\n\nThe names of the functions follow a few general rules. \n\n- The shiny-based functions are all prefixed with `shiny`. E.g. `shinyswipr`, `shinydrawr`...\n\n- Of those shiny-based functions there are two functions per sense, the server function (just plain name), and the UI function, which has `_UI` appended to the end. \n\n_Note that if you used shinysense in earlier versions, this naming scheme was inconsistent, I si\n... (truncated)"
    }
  }
]