[
  {
    "name": "gavanderhoorn/dominh",
    "stars": 48,
    "description": "Poor man's RPC interface to Fanuc robot controllers in Python",
    "languages_breakdown": {
      "Python": 104403,
      "Makefile": 527
    },
    "files": {
      "requirements.txt": "docopt\nrequests\n",
      ".github/workflows/ci.yml": "name: CI\n\non: [push]\n\njobs:\n  build:\n\n    runs-on: ubuntu-latest\n    strategy:\n      matrix:\n        python-version: [3.8, 3.9]\n\n    steps:\n    - uses: actions/checkout@v2\n    - name: Set up Python ${{ matrix.python-version }}\n      uses: actions/setup-python@v1\n      with:\n        python-version: ${{ matrix.python-version }}\n    - name: Install dependencies\n      run: |\n        python -m pip install --upgrade pip\n        pip install -r requirements.txt\n    - name: Lint with flake8\n      run: |\n        pip install flake8\n        # stop the build if there are Python syntax errors or undefined names\n        flake8 . --count --select=E9,F63,F7,F82 --show-source --statistics\n        # exit-zero treats all errors as warnings.\n        flake8 . --count --max-complexity=10 --statistics\n",
      "README.md": "# Dominh\n\n[![license - apache 2.0](https://img.shields.io/:license-Apache%202.0-yellowgreen.svg)](https://opensource.org/licenses/Apache-2.0)\n[![CI](https://github.com/gavanderhoorn/dominh/workflows/CI/badge.svg?branch=master)](https://github.com/gavanderhoorn/dominh/actions?query=workflow%3ACI)\n[![Github Issues](https://img.shields.io/github/issues/gavanderhoorn/dominh.svg)](https://github.com/gavanderhoorn/dominh/issues)\n\n## Discussion\n\nIf you happen to find this useful, leave a quick note in the [Discussions section](https://github.com/gavanderhoorn/dominh/discussions).\nIf something doesn't work, open an issue [on the tracker](https://github.com/gavanderhoorn/dominh/issues).\n\n## Overview\n\nThis is a poor man's version of a subset of the RPC functionality provided by the (Windows-only) Fanuc PCDK implemented in Python.\nThis uses the *Web Svr Enhancements* option (`R626`) and the interfaces it provides to the controller (see note in [Requirements](#requirements)).\nOnly a subset of the functionality is currently available and performance will not be comparable with the PCDK.\n\nAdditionally a simple set of CLI tools is included, which allows some of the library's functionality to be used from the command line and/or in shell scripts.\n\n**NOTE**: this is only meant as an example of such a remote control facility.\nProper integration of a Fanuc controller with an external application or workcell should be done using either the real PCDK, a fieldbus or similar technology.\nThe scripts and functionality provided here are only a convenience and are only intended to be used in academic and laboratory settings.\nThey allow incidental external access to a controller without needing to use any additional hardware.\nDo not use this on production systems or in contexts where any kind of determinism is required.\nThe author recommends using PCDK and/or any of the supported fieldbuses in those cases.\n\n**NOTE 2**: on R-30iB+ controllers, option `R912` can do some of the things this library supports.\n\n**NOTE 3**: on controllers with sufficiently recent system software versions, an OPC-UA server is included. Access over OPC-UA would also support some of the things this library supports.\n\n## TOC\n\n1. [Requirements](#requirements)\n1. [Compatibility](#compatibility)\n1. [Installation](#installation)\n1. [Example usage](#example-usage)\n1. [Supported functionality](#supported-functionality)\n1. [Limitations / Known issues](#limitations-known-issues)\n1. [Performance](#performance)\n1. [Related projects](#related-projects)\n1. [Bugs, feature requests, etc](#bugs-feature-requests-etc)\n1. [FAQ](#faq)\n1. [Disclaimer](#disclaimer)\n\n## Requirements\n\nThis needs the base *Web Server* (`HTTP`) and the *Web Svr Enhancements* (`R626`) options (note: contrary to what the manual states, this is not a separate option: all functionality is already built-in, at least for R-30iA and newer controllers).\nAs some parts are written in Karel, option `R632` could be a requirement, but this is unlikely.\n\nO\n... (truncated)"
    }
  },
  {
    "name": "gavanderhoorn/fanuc_driver_exp",
    "stars": 35,
    "description": "An alternative - experimental - Fanuc robot driver for ROS-Industrial",
    "languages_breakdown": {
      "LiveScript": 2464
    },
    "files": {
      "package.json": "{\n  \"manver\" : \"1\",\n  \"project\" : \"fanuc_driver_exp\",\n  \"description\" : \"Experimental Fanuc ROS-I driver\",\n  \"version\" : \"0.1.0\",\n  \"license\" : \"Apache 2.0\",\n  \"author\" : \"G.A. vd. Hoorn\",\n  \"source\" : [\n    \"src/librosfanuc.kl\",\n    \"src/libssock.kl\",\n    \"src/ros_state.kl\",\n    \"src/ros_traj.kl\",\n    \"src/rstate_cfg.kl\",\n    \"src/rtraj_cfg.kl\"\n  ],\n  \"includes\" : [\n    \"include\"\n  ],\n  \"depends\" : [\n    \"libindlog\",\n    \"libsimplemsg\",\n    \"libmathex\",\n    \"libstdex\"\n  ]\n}\n",
      "README.md": "# fanuc_driver_exp\n\nAn alternative - experimental - Fanuc robot driver for ROS-Industrial.\n\n\n## Overview\n\nMain differences with `fanuc_driver`:\n\n - tries to adhere to commanded velocity constraints on trajectory segments (but will most likely fail)\n - adds out-of-the-box support for linear joints / tracks\n - 125 Hz / 83 Hz joint state reporting (controller maximum, depending on `ITP`)\n - decouples network traffic processing from trajectory execution\n - proper support for trajectory goal `abort` (ie: motion cancel using a `SKIP` condition), but see [issue 3][]\n - adds a configurable length point-buffer to minimise influence of network latency between controller and ROS PC\n - significantly more robust and flexible network code\n - extensive use of `rossum` build infrastructure support (modularity, code reuse)\n\n\n## Note on performance\n\nWhile this implementation of a ROS driver for Fanuc controllers has improved upon `fanuc_driver` already, it could still be improved quite significantly. This is especially true for the motion performance, both in terms of maximum attainable robot velocity as well as in the trade-off between smoothness and accuracy (or: path / trajectory reproduction).\n\nWith the current understanding of Fanuc controller internals it would appear that the trade-off between motion smoothness and trajectory reproduction accuracy (ie: `CNT`) will *always* be a limiting factor to any kind of external motion control with Fanuc controllers (that use(d) publicly available interfaces to that controller).\n\nDense trajectories will cause significant slowdown of the robot leading to total path execution duration significantly exceeding the specified timestamps. Coarse trajectories will lead to inaccurate motions, but higher maximum robot velocity attained.\n\nThe current implementation (with a single point buffer and a minimum TP program to execute the motion) does not permit the controller to make use of its look-ahead functionality, which severely bottlenecks it and leads to suboptimal motion in almost all cases (in terms of velocity and continuity: the robot will still reach the commanded position(s)).\n\nThis driver is therefore better suited to pick-and-place type of applications (ie: discrete motions in which the goal positions are more important than the path itself) and less for applications that require accurate control over all aspects of the motion at all times (ie: continuous applications in which the path itself is as-important or more important than the final destination).\n\n\n## Installation\n\nInstallation using a binary distribution is preferred, but building from sources is also supported.\n\n\n### Binaries\n\nDetermine the system software version running on the target controller, then download the latest binary distribution from the [releases][] page.\n\nExtract the zip file to a suitable location and follow the steps under [Copying](#copying).\n\n\n### Source build\n\nNote: the below steps use Dirk Thomas' [vcstool][] to clone all required reposito\n... (truncated)"
    }
  },
  {
    "name": "gavanderhoorn/fanuc_dpm_mouse_demo",
    "stars": 27,
    "description": "A simple demo showing Fanuc DPM controlled with a mouse",
    "languages_breakdown": {
      "Python": 2971,
      "LiveScript": 1510,
      "Batchfile": 318
    },
    "files": {}
  }
]