[
  {
    "name": "tib/practical-server-side-swift",
    "stars": 253,
    "description": "Vapor 4 code samples for the Practical Server Side Swift book",
    "languages_breakdown": {
      "Swift": 1264863,
      "Dockerfile": 50040,
      "JavaScript": 2436,
      "CSS": 751
    },
    "files": {
      "README.md": "# 📖 Practical Server Side Swift\n\nVapor 4 code samples for the [Practical Server Side Swift book](https://gumroad.com/l/practical-server-side-swift) available on [Gumroad](https://gumroad.com/l/practical-server-side-swift).  \n\n**Chapter 1: Introduction** We start with an introduction to the Server Side Swift world, explaining the evolution of Swift as a universal programming language. We'll talk about both the strengths and weaknesses of the language and discuss why Swift is a good choice to build backend applications. We'll explore the Swift ecosystem and the open-source movement that made it possible to create the necessary tools on Linux to turn Swift into a server-side language. You'll get introduced to Vapor, the most popular web application framework, that we're going to use in this book.\n\n**Chapter 2: Getting started with Vapor** Next, we go over detailed instructions about how to install all the required components to build server-side Swift applications both on Linux and macOS. You'll meet some command-line tools that can help your everyday life as a backend developer and we'll create our very first Vapor project using the Swift Package Manager. We'll also set up the Vapor toolbox, a handy little tool that can help you bootstrap projects based on a template. In the very last section, we'll briefly take a look at the architecture of a Vapor application.\n\n**Chapter 3: Getting started with SwiftHtml** Then we're going to build our first website using the SwiftHtml library, and we're going to generate HTML code through Swift by creating template files using a Domain Specific Language (DSL). You'll learn about how to connect SwiftHtml with Vapor and how to render HTML by using context variables to provide additional template data. You'll learn about the syntax of SwiftHtml, how to iterate through objects, how to check optional variables, and how to extend a base template to provide a reusable framework for our website, and finally, we'll build a simple blog layout with a post, list, and detail pages.\n\n**Chapter 4: Getting started with Fluent** Here you'll learn about the Fluent ORM framework and the advantages of using such a tool instead of writing raw database queries. We'll set up Fluent, powered by the SQLite driver, and model our database fields using property wrappers in Swift. We're going to provide a seed for our database, get familiar with migration scripts, and make some changes on the website so it can query blog posts from the local database and render them using view templates.\n\n**Chapter 5: Sessions and user authentication** We're going to focus on building a session-based web authentication layer that users will be able to use to sign in using a form, and with which already logged in users will be authenticated with the help of a session cookie and persistent session storage using Fluent. In the second half of this chapter, I'll show you how to create a custom authenticator middleware that'll allow you to authenticate users base\n... (truncated)"
    }
  },
  {
    "name": "tib/SwiftNES",
    "stars": 55,
    "description": "Just another NES emulator written in Swift",
    "languages_breakdown": {
      "Swift": 252550
    },
    "files": {
      "README.md": "# SwiftNes\n\nThis repo contains all the source code for my experimental [100 days of NES](https://twitter.com/search?q=100daysOfNES&src=typed_query) challenge.\n\n## What is this all about?\n\nI'm planning to build a fully working NES emulator in a 100 days. \n\nBut Why? 🤔 \n\nI just want learn more about low level hardware devices (CPU, memory, etc.) asm code, Swift and computers in general.\n\nWish me luck and feel free to start discussions, raise issues & PRs. 🍀\n\nFYI: The challenge started on the 8th of September 2021. \n\n\n## Useful resources\n\n- [6502](http://www.obelisk.me.uk/6502/)\n- [Nesdev Wiki](https://wiki.nesdev.com)\n- [NES emulator from scratch](https://www.youtube.com/playlist?app=desktop&list=PLrOv9FMX8xJHqMvSGB_9G9nZZ_4IgteYf)\n- [6502 CPU Emulator in C++](https://www.youtube.com/watch?v=qJgsuQoy9bc&list=PLLwK93hM93Z13TRzPx9JqTIn33feefl37)\n\n"
    }
  },
  {
    "name": "tib/learn-to-code-using-swift",
    "stars": 2,
    "description": "无",
    "languages_breakdown": {},
    "files": {}
  }
]